const board = [
  [1, 0, 5, 8, 0, 2, 0, 0, 0],
  [0, 9, 0, 0, 7, 6, 4, 0, 5],
  [2, 0, 0, 4, 0, 0, 8, 1, 9],
  [0, 1, 9, 0, 0, 7, 3, 0, 6],
  [7, 6, 2, 0, 8, 3, 0, 9, 0],
  [0, 0, 0, 0, 6, 1, 0, 5, 0],
  [0, 0, 7, 6, 0, 0, 0, 3, 0],
  [4, 3, 0, 0, 2, 0, 5, 0, 1],
  [6, 0, 0, 3, 0, 8, 9, 0, 0]
];

function prettyBoard(board) {
  if (typeof board !== 'object' || board.length !== 81) {
    // если не является строкой или длина переданного аргумента не равна 81 (9 по 9)
    console.log('Неправильный формат доски'); //  Выводим ошибку в консоль
    // Прекращаем выполнение функции
  }
 const result = board.join('').split('').join('')
}
