// принимаю Массив массивов от Димы и мне нужно сделать из этого измененный массив массивов со вставкой туда чисел новых
function solve(arr) {
    const newArr = arr.map((number) => number.map((num) => num === '-' ? num = '0': num))
    return newArr.join('\n').split('\n');
}

console.log(
  solve(
    [
      ['1', '-', '5', '8', '-', '2', '-', '-', '-'],
      ['-', '9', '-', '-', '7', '6', '4', '-', '5'],
      ['2', '-', '-', '4', '-', '-', '8', '1', '9'],
      ['-', '1', '9', '-', '-', '7', '3', '-', '6'],
      ['7', '6', '2', '-', '8', '3', '-', '9', '-'],
      ['-', '-', '-', '-', '6', '1', '-', '5', '-'],
      ['-', '-', '7', '6', '-', '-', '-', '3', '-'],
      ['4', '3', '-', '-', '2', '-', '5', '-', '1'],
      ['6', '-', '-', '3', '-', '8', '9', '-', '-'],
    ]
  ),
);
